Repository: phanvantai/BabyStory
Catalog: SoftDreams/Resources/*.lproj/Localizable.strings
Languages: vi

# app_error_recovery_configuration
source: Please check your story generation settings and try again.
vi: Vui lòng kiểm tra cài đặt tạo câu chuyện và thử lại.

# app_error_recovery_name_length
source: Name should be between 1 and 50 characters.
vi: Tên phải từ 1 đến 50 ký tự.

# app_error_recovery_date_validation
source: Please select a valid date within the allowed range.
vi: Vui lòng chọn ngày hợp lệ trong phạm vi cho phép.

# app_error_recovery_story_options
source: Please check your story options and try again.
vi: Vui lòng kiểm tra tùy chọn câu chuyện và thử lại.

# app_error_recovery_character_limit
source: Please select up to 5 characters for your story.
vi: Vui lòng chọn tối đa 5 nhân vật cho câu chuyện của bạn.

# story_length_short
source: Quick tale (2-3 minutes)
vi: Câu chuyện ngắn (2-3 phút)

# story_length_medium
source: Perfect story (5-7 minutes)
vi: Câu chuyện hoàn hảo (5-7 phút)

# story_length_long
source: Extended adventure (10+ minutes)
vi: Cuộc phiêu lưu dài (10+ phút)

# story_theme_adventure
source: Exciting journeys and discoveries
vi: Những hành trình thú vị và khám phá

# story_theme_friendship
source: Stories about making friends and caring
vi: Câu chuyện về việc kết bạn và quan tâm

# story_theme_magic
source: Enchanted worlds and wonder
vi: Thế giới phép thuật và kỳ diệu

# story_theme_animals
source: Friendly creatures and nature
vi: Những sinh vật thân thiện và thiên nhiên

# story_theme_learning
source: Fun lessons and new skills
vi: Bài học vui nhộn và kỹ năng mới

# story_theme_kindness
source: Being helpful and caring for others
vi: Giúp đỡ và quan tâm đến người khác

# story_theme_nature
source: Beautiful outdoors and gardens
vi: Thiên nhiên đẹp và khu vườn

# story_theme_family
source: Love, togetherness and belonging
vi: Tình yêu, sự gắn kết và thuộc về

# story_theme_dreams
source: Peaceful nighttime adventures
vi: Cuộc phiêu lưu êm dịu trong đêm

# story_theme_creativity
source: Art, music and imagination
vi: Nghệ thuật, âm nhạc và trí tưởng tượng

# due_date_notification_title_three_days_before
source: Due Date Reminder 📅
vi: Nhắc Nhở Ngày Sinh Dự Kiến 📅

# due_date_notification_title_on_due_date
source: Due Date Today! 🎉
vi: Hôm Nay Là Ngày Sinh Dự Kiến! 🎉

# due_date_notification_title_two_days_after
source: Profile Update Reminder 👶
vi: Nhắc Nhở Cập Nhật Hồ Sơ 👶

# due_date_notification_body_three_days_before
source: Baby %@ is due in 3 days! Consider updating your profile if your due date has changed.
vi: Bé %@ dự kiến sinh trong 3 ngày nữa! Hãy cân nhắc cập nhật hồ sơ nếu ngày sinh dự kiến đã thay đổi.

# due_date_notification_body_on_due_date
source: Baby %@ is due today! Don't forget to update your profile when baby arrives.
vi: Hôm nay là ngày sinh dự kiến của bé %@! Đừng quên cập nhật hồ sơ khi bé chào đời.

# due_date_notification_body_two_days_after
source: How is baby %@? Please update your profile to continue enjoying personalized stories.
vi: Bé %@ thế nào rồi? Vui lòng cập nhật hồ sơ để tiếp tục tận hưởng những câu chuyện được cá nhân hóa.

# story_time_notification_title
source: Story Time Coming Up! 📚
vi: Sắp Đến Giờ Kể Chuyện! 📚

# story_time_notification_body
source: It's almost time for your bedtime story. Get ready for a magical adventure!
vi: Sắp đến giờ kể chuyện trước khi đi ngủ. Hãy chuẩn bị cho một cuộc phiêu lưu diệu kỳ!

# story_time_notification_body_personalized
source: It's almost time for %@'s bedtime story. Get ready for a magical adventure!
vi: Sắp đến giờ kể chuyện của %@. Hãy chuẩn bị cho một cuộc phiêu lưu diệu kỳ!

# permission_context_pregnancy_reason
source: Get helpful reminders about your pregnancy journey
vi: Nhận những lời nhắc hữu ích về hành trình thai kỳ của bạn

# permission_context_story_time_reason
source: Never miss story time with your little one
vi: Không bao giờ bỏ lỡ giờ kể chuyện với bé yêu

# permission_context_general_reason
source: Stay connected with your SoftDreams experience
vi: Luôn kết nối với trải nghiệm SoftDreams của bạn

# permission_benefit_due_date_reminders
source: Due date reminders
vi: Nhắc nhở ngày sinh dự kiến

# permission_benefit_profile_update_suggestions
source: Profile update suggestions
vi: Gợi ý cập nhật hồ sơ

# permission_benefit_important_milestones
source: Important milestones
vi: Các cột mốc quan trọng

# permission_benefit_daily_story_reminders
source: Daily story time reminders
vi: Nhắc nhở giờ kể chuyện hàng ngày

# permission_benefit_reading_routine_notifications
source: Reading routine notifications
vi: Thông báo thói quen đọc sách

# permission_benefit_new_story_alerts
source: New story alerts
vi: Cảnh báo câu chuyện mới

# permission_benefit_story_time_reminders
source: Story time reminders
vi: Nhắc nhở giờ kể chuyện

# permission_benefit_profile_updates
source: Profile updates
vi: Cập nhật hồ sơ

# permission_benefit_milestone_celebrations
source: Special milestone celebrations
vi: Lễ kỷ niệm cột mốc đặc biệt

# theme_mode_system
source: System
vi: Hệ Thống

# theme_mode_light
source: Light
vi: Sáng

# theme_mode_dark
source: Dark
vi: Tối

# edit_profile_age_not_set
source: Not set
vi: Chưa đặt

# edit_profile_age_one_month
source: 1 month old
vi: 1 tháng tuổi

# edit_profile_age_months_format
source: %d months old
vi: %d tháng tuổi

# edit_profile_age_one_year
source: 1 year old
vi: 1 tuổi

# edit_profile_age_years_format
source: %d years old
vi: %d tuổi

# edit_profile_age_unknown
source: Unknown age
vi: Tuổi không xác định

# onboarding_story_morning_adventures
source: Morning Adventures
vi: Cuộc Phiêu Lưu Buổi Sáng

# onboarding_story_wake_up_stories
source: Wake-up Stories
vi: Câu Chuyện Thức Dậy

# onboarding_story_breakfast_tales
source: Breakfast Tales
vi: Câu Chuyện Bữa Sáng

# onboarding_story_sunny_day_fun
source: Sunny Day Fun
vi: Niềm Vui Ngày Nắng

# onboarding_story_afternoon_play
source: Afternoon Play
vi: Chơi Đùa Buổi Chiều

# onboarding_story_learning_stories
source: Learning Stories
vi: Câu Chuyện Học Tập

# onboarding_story_outdoor_adventures
source: Outdoor Adventures
vi: Phiêu Lưu Ngoài Trời

# onboarding_story_friend_tales
source: Friend Tales
vi: Câu Chuyện Về Bạn Bè

# onboarding_story_bedtime_stories
source: Bedtime Stories
vi: Câu Chuyện Ru Ngủ

# onboarding_story_calm_adventures
source: Calm Adventures
vi: Cuộc Phiêu Lưu Êm Dịu

# onboarding_story_dream_journeys
source: Dream Journeys
vi: Hành Trình Trong Mơ

# onboarding_story_goodnight_tales
source: Goodnight Tales
vi: Câu Chuyện Chúc Ngủ Ngon

# onboarding_story_peaceful_dreams
source: Peaceful Dreams
vi: Giấc Mơ Yên Bình

# onboarding_story_quiet_stories
source: Quiet Stories
vi: Câu Chuyện Tĩnh Lặng

# onboarding_story_sleep_adventures
source: Sleep Adventures
vi: Cuộc Phiêu Lưu Giấc Ngủ

# onboarding_story_gentle_tales
source: Gentle Tales
vi: Câu Chuyện Dịu Dàng

# loading_default_message
source: Loading...
vi: Đang tải...

# notification_permission_enable_title
source: Enable Notifications
vi: Bật Thông Báo

# notification_permission_learn_more
source: Learn More
vi: Tìm Hiểu Thêm

# notification_permission_enable_button
source: Enable
vi: Bật

# notification_permission_sheet_stay_connected
source: Stay Connected
vi: Luôn Kết Nối

# notification_permission_sheet_navigation_title
source: Notifications
vi: Thông Báo

# notification_permission_sheet_skip
source: Skip
vi: Bỏ Qua

# notification_permission_sheet_description
source: We'll ask your permission to send notifications. You can always change this in Settings later.
vi: Chúng tôi sẽ xin phép bạn để gửi thông báo. Bạn luôn có thể thay đổi điều này trong Cài đặt sau.

# notification_permission_sheet_requesting
source: Requesting...
vi: Đang yêu cầu...

# notification_permission_sheet_enable_notifications
source: Enable Notifications
vi: Bật Thông Báo

# notification_permission_sheet_not_now
source: Not Now
vi: Không Phải Bây Giờ

# notification_permission_sheet_denied_description
source: Notifications are currently disabled. You can enable them in Settings to get the full SoftDreams experience.
vi: Thông báo hiện đang bị tắt. Bạn có thể bật chúng trong Cài đặt để có trải nghiệm SoftDreams đầy đủ.

# notification_permission_sheet_open_settings
source: Open Settings
vi: Mở Cài Đặt

# notification_permission_sheet_continue_without
source: Continue Without Notifications
vi: Tiếp Tục Không Có Thông Báo

# story_listen_to_story
source: Listen to Story
vi: Nghe chuyện

# story_illustration_placeholder
source: Story Illustration
vi: Hình Minh Họa Câu Chuyện

# generate_story_customize_title
source: Customize Your Story
vi: Tùy Chỉnh Câu Chuyện

# generate_story_customize_subtitle
source: Create the perfect adventure
vi: Tạo cuộc phiêu lưu hoàn hảo

# generate_story_length_title
source: Story Length
vi: Độ Dài Câu Chuyện

# generate_story_length_quick_tale
source: Quick Tale
vi: Câu Chuyện Ngắn

# generate_story_length_perfect_story
source: Perfect Story
vi: Câu Chuyện Hoàn Hảo

# generate_story_length_extended_adventure
source: Extended Adventure
vi: Cuộc Phiêu Lưu Dài

# generate_story_theme_title
source: Story Theme
vi: Chủ Đề Câu Chuyện

# generate_story_characters_title
source: Characters
vi: Nhân Vật

# generate_story_characters_placeholder
source: Add characters (e.g., brave princess, friendly dragon)
vi: Thêm nhân vật (ví dụ: công chúa dũng cảm, rồng thân thiện)

# generate_story_characters_help_text
source: Separate multiple characters with commas
vi: Phân tách nhiều nhân vật bằng dấu phẩy

# generate_story_create_button
source: Create My Story
vi: Tạo Câu Chuyện Của Tôi

# generate_story_generating_button
source: Creating Story...
vi: Đang Tạo Câu Chuyện...

# generate_story_customize_nav_title
source: Customize
vi: Tùy Chỉnh

# ai_model_gpt35_turbo_description
source: Fast and simple storytelling for everyday bedtime stories
vi: Kể chuyện nhanh và đơn giản cho những câu chuyện ru ngủ hàng ngày

# ai_model_gpt35_turbo_16k_description
source: Extended storytelling with longer, more detailed bedtime adventures
vi: Kể chuyện mở rộng với những cuộc phiêu lưu ru ngủ dài hơn, chi tiết hơn

# ai_model_gpt4_description
source: High-quality, thoughtful stories with rich character development
vi: Những câu chuyện chất lượng cao, suy tư với sự phát triển nhân vật phong phú

# ai_model_gpt4_turbo_description
source: Fast premium storytelling with exceptional creativity and detail
vi: Kể chuyện cao cấp nhanh chóng với khả năng sáng tạo và chi tiết đặc biệt

# ai_model_gpt4_mini_description
source: Efficient and charming stories perfect for quick bedtime reads
vi: Những câu chuyện hiệu quả và quyến rũ hoàn hảo cho việc đọc nhanh trước khi ngủ

# ai_model_gpt4o_description
source: Rich, imaginative, and emotionally expressive stories that captivate young minds
vi: Những câu chuyện phong phú, đầy tưởng tượng và cảm xúc, quyến rũ tâm trí trẻ thơ

# ai_model_claude3_haiku_description
source: Quick and gentle stories with a warm, nurturing tone perfect for bedtime
vi: Những câu chuyện nhanh và nhẹ nhàng với giọng điệu ấm áp, nuôi dưỡng hoàn hảo cho giờ đi ngủ

# ai_model_claude3_sonnet_description
source: Beautifully crafted, gentle stories with warmth and emotional depth
vi: Những câu chuyện được tạo ra một cách tuyệt đẹp, nhẹ nhàng với sự ấm áp và chiều sâu cảm xúc

# ai_model_gemini_pro_description
source: Creative and varied storytelling with engaging adventures and learning moments
vi: Kể chuyện sáng tạo và đa dạng với những cuộc phiêu lưu hấp dẫn và khoảnh khắc học hỏi

# ai_model_selection_title
source: Story Style
vi: Phong Cách Câu Chuyện

# ai_model_selection_description
source: Choose the AI model that will create your bedtime stories
vi: Chọn mô hình AI sẽ tạo ra những câu chuyện ru ngủ của bạn

# ai_model_premium_badge
source: Premium
vi: Cao Cấp

# ai_model_free_badge
source: Free
vi: Miễn Phí

# ai_model_premium_required
source: Premium subscription required
vi: Cần đăng ký cao cấp

# ai_model_upgrade_prompt
source: Upgrade to unlock different story styles and premium models
vi: Nâng cấp để mở khóa các phong cách câu chuyện khác nhau và mô hình cao cấp

# home_story_limit_reached
source: You've reached your daily story limit
vi: Bạn đã đạt đến giới hạn câu chuyện hôm nay

# home_one_story_remaining
source: Only 1 story remaining today
vi: Chỉ còn 1 câu chuyện hôm nay

# paywall_ready_for_more
source: Ready for More Stories?
vi: Sẵn sàng cho nhiều câu chuyện hơn?

# paywall_stories_created_today
source: You've created %d amazing stories today. Upgrade to Premium for unlimited creativity!
vi: Bạn đã tạo %d câu chuyện tuyệt vời hôm nay. Nâng cấp lên Premium để sáng tạo không giới hạn!

# paywall_select_plan
source: Select a Plan
vi: Chọn Gói

# paywall_start_trial
source: Start Free Trial
vi: Bắt đầu Dùng Thử Miễn Phí

# paywall_cancel_anytime
source: Cancel anytime
vi: Hủy bất kỳ lúc nào

# paywall_terms_agreement
source: By starting your trial, you agree to our
vi: Bằng cách bắt đầu dùng thử, bạn đồng ý với

# paywall_terms_of_service
source: Terms of Service
vi: Điều Khoản Dịch Vụ

# paywall_and
source: and
vi: và

# paywall_privacy_policy
source: Privacy Policy
vi: Chính Sách Bảo Mật

# paywall_purchase_error
source: Purchase Error
vi: Lỗi Mua Hàng

# paywall_restore_purchases
source: Restore Purchases
vi: Khôi Phục Mua Hàng

# paywall_no_purchases_to_restore
source: No previous purchases found to restore for this Apple ID.
vi: Không tìm thấy giao dịch mua hàng nào để khôi phục cho Apple ID này.

# paywall_premium_active
source: Premium Active
vi: Premium Đang Hoạt Động

# paywall_premium_thank_you
source: Thank you for being a premium member!
vi: Cảm ơn bạn đã là thành viên premium!

# paywall_premium_features
source: Your Premium Benefits
vi: Quyền Lợi Premium Của Bạn

# paywall_close
source: Close
vi: Đóng

# story_usage_title
source: Today's Story Usage
vi: Số lượng câu chuyện hôm nay

# story_usage_count
source: %d/%d stories
vi: %d/%d câu chuyện

# story_usage_free_plan
source: Free Plan
vi: Gói Miễn Phí

# story_usage_premium_plan
source: Premium Plan
vi: Gói Premium

source: Save 33%
vi: Tiết kiệm 33%

# settings_premium_section
source: Premium Features
vi: Tính Năng Premium

# settings_premium_features
source: View Premium Features
vi: Xem Tính Năng Premium

# settings_premium_features_description
source: Unlock advanced AI models and more stories
vi: Mở khóa các mô hình AI nâng cao và nhiều câu chuyện hơn

# settings_restore_purchases
source: Restore Purchases
vi: Khôi Phục Mua Hàng

# settings_restore_purchases_description
source: Restore your previous premium subscription
vi: Khôi phục gói đăng ký premium trước đây của bạn

# feature_custom_story_settings
source: Custom Story Settings
vi: Tùy chỉnh cài đặt câu chuyện

# feature_advanced_ai_models
source: Access to advanced AI models
vi: Truy cập các mô hình AI nâng cao

# feature_voice_narration
source: Voice narration
vi: Đọc chuyện bằng giọng nói

# feature_multiple_baby_profiles
source: Multiple Baby Profiles
vi: Nhiều hồ sơ bé

# feature_daily_story_limit
source: 20 stories per day
vi: 20 câu chuyện mỗi ngày

# subscription_trial_period
source: 7-days free trial
vi: Dùng thử miễn phí 7 ngày

# subscription_cancel_anytime
source: Cancel anytime
vi: Hủy bất kỳ lúc nào

# subscription_premium_features
source: Premium Features
vi: Mở khóa các tính năng Premium
