Repository: phanvantai/BabyStory
Catalog: SoftDreams/Resources/*.lproj/Localizable.strings
Languages: vi

# app_loading_title
source: Loading SoftDreams...
vi: Đang tải SoftDreams...

# language_selection_title
source: Welcome to SoftDreams
vi: Chào mừng đến với SoftDreams

# language_selection_subtitle
source: Choose your preferred language for the best experience
vi: Chọn ngôn ngữ yêu thích của bạn để có trải nghiệm tốt nhất

source: Choose Language
vi: Chọn Ngôn Ngữ

source: Current Selection:
vi: Lựa chọn hiện tại:

# language_change_later_note
source: You can change this later in Settings if needed
vi: Bạn có thể thay đổi điều này sau trong Cài đặt nếu cần

# continue_with_language
source: Continue with %@
vi: Tiếp tục với %@

source: Language Settings
vi: Cài đặt Ngôn Ngữ

# onboarding_welcome_welcome_to
source: Welcome to
vi: Chào mừng đến với

# onboarding_welcome_headline
source: Create magical bedtime stories
vi: Tạo những câu chuyện ru ngủ kỳ diệu

# onboarding_welcome_description
source: Personalized adventures that spark imagination and create lasting memories for your little one
vi: Những cuộc phiêu lưu được cá nhân hóa khơi dậy trí tưởng tượng và tạo ra những kỷ niệm lâu dài cho bé yêu của bạn

# onboarding_welcome_lets_begin
source: Let's Begin
vi: Bắt Đầu Nào

# baby_stage_name_infant
source: Infant (3-12 months)
vi: Trẻ sơ sinh (3-12 tháng)

# baby_stage_name_toddler
source: Toddler (1-3 years)
vi: Trẻ mới biết đi (1-3 tuổi)

# baby_stage_name_preschooler
source: Preschooler (3-5 years)
vi: Trẻ mầm non (3-5 tuổi)

# baby_stage_name_newborn
source: Newborn (0-3 months)
vi: Trẻ sơ sinh (0-3 tháng)

# baby_stage_name_pregnancy
source: During Pregnancy
vi: Trong thai kỳ

# baby_stage_description_pregnancy
source: Create bonding stories for your unborn baby
vi: Tạo những câu chuyện gắn kết cho bé trong bụng mẹ

# baby_stage_description_newborn
source: Gentle, soothing stories for newborns
vi: Những câu chuyện nhẹ nhàng, êm dịu cho trẻ sơ sinh

# baby_stage_description_infant
source: Simple stories with sounds and textures
vi: Những câu chuyện đơn giản với âm thanh và kết cấu

# baby_stage_description_toddler
source: Interactive stories with basic lessons
vi: Những câu chuyện tương tác với bài học cơ bản

# baby_stage_description_preschooler
source: Adventure stories with moral lessons
vi: Những câu chuyện phiêu lưu với bài học đạo đức

# baby_stage_interest_classical_music
source: Classical Music
vi: Nhạc Cổ Điển

# baby_stage_interest_nature_sounds
source: Nature Sounds
vi: Âm Thanh Thiên Nhiên

# baby_stage_interest_gentle_stories
source: Gentle Stories
vi: Câu Chuyện Nhẹ Nhàng

# baby_stage_interest_parent_bonding
source: Parent Bonding
vi: Gắn Kết Với Bố Mẹ

# baby_stage_interest_relaxation
source: Relaxation
vi: Thư Giãn

# baby_stage_interest_love_care
source: Love & Care
vi: Tình Yêu & Chăm Sóc

# baby_stage_interest_lullabies
source: Lullabies
vi: Những Bài Hát Ru

# baby_stage_interest_gentle_sounds
source: Gentle Sounds
vi: Âm Thanh Nhẹ Nhàng

# baby_stage_interest_soft_colors
source: Soft Colors
vi: Màu Sắc Dịu Nhẹ

# baby_stage_interest_comfort
source: Comfort
vi: Sự Thoải Mái

# baby_stage_interest_sleep
source: Sleep
vi: Giấc Ngủ

# baby_stage_interest_feeding_time
source: Feeding Time
vi: Giờ Ăn

# baby_stage_interest_parent_voice
source: Parent Voice
vi: Giọng Nói Của Bố Mẹ

# baby_stage_interest_peek_a_boo
source: Peek-a-boo
vi: Ú Òa

# baby_stage_interest_simple_sounds
source: Simple Sounds
vi: Âm Thanh Đơn Giản

# baby_stage_interest_textures
source: Textures
vi: Kết Cấu

# baby_stage_interest_movement
source: Movement
vi: Chuyển Động

# baby_stage_interest_smiles
source: Smiles
vi: Nụ Cười

# baby_stage_interest_discovery
source: Discovery
vi: Khám Phá

# baby_stage_interest_clapping
source: Clapping
vi: Vỗ Tay

# baby_stage_interest_faces
source: Faces
vi: Khuôn Mặt

# baby_stage_interest_animals
source: Animals
vi: Động Vật

# baby_stage_interest_colors
source: Colors
vi: Màu Sắc

# baby_stage_interest_numbers
source: Numbers
vi: Số

# baby_stage_interest_vehicles
source: Vehicles
vi: Phương Tiện

# baby_stage_interest_nature
source: Nature
vi: Thiên Nhiên

# baby_stage_interest_family
source: Family
vi: Gia Đình

# baby_stage_interest_friends
source: Friends
vi: Bạn Bè

# baby_stage_interest_playing
source: Playing
vi: Chơi

# baby_stage_interest_songs
source: Songs
vi: Bài Hát

# baby_stage_interest_repetition
source: Repetition
vi: Lặp Lại

# baby_stage_interest_adventure
source: Adventure
vi: Phiêu Lưu

# baby_stage_interest_magic
source: Magic
vi: Phép Thuật

# baby_stage_interest_friendship
source: Friendship
vi: Tình Bạn

# baby_stage_interest_learning
source: Learning
vi: Học Tập

# baby_stage_interest_imagination
source: Imagination
vi: Trí Tưởng Tượng

# baby_stage_interest_problem_solving
source: Problem Solving
vi: Giải Quyết Vấn Đề

# baby_stage_interest_emotions
source: Emotions
vi: Cảm Xúc

# baby_stage_interest_school
source: School
vi: Trường Học

# baby_stage_interest_helping_others
source: Helping Others
vi: Giúp Đỡ Người Khác

# baby_stage_interest_curiosity
source: Curiosity
vi: Tò Mò

# onboarding_profile_title
source: Tell us about your baby
vi: Hãy cho chúng tôi biết về bé

# onboarding_profile_subtitle
source: This helps us create the perfect stories
vi: Điều này giúp chúng tôi tạo ra những câu chuyện hoàn hảo

# onboarding_profile_baby_name_label
source: Baby's Name
vi: Tên của Bé

# onboarding_profile_baby_name_placeholder
source: What will you call your baby?
vi: Bạn sẽ gọi bé bằng tên gì?

# onboarding_profile_child_name_label
source: Name
vi: Tên

# onboarding_profile_child_name_placeholder
source: Enter your child's name
vi: Nhập tên của con bạn

# baby_status_title
source: Baby Status
vi: Tình Trạng Bé

# baby_status_pregnant
source: I'm Pregnant
vi: Tôi Đang Mang Thai

# baby_status_pregnant_description
source: Create bonding stories for your unborn baby
vi: Tạo những câu chuyện gắn kết cho bé trong bụng mẹ

# baby_status_born
source: My Baby is Already Born
vi: Bé Của Tôi Đã Chào Đời

# baby_status_born_description
source: Create personalized stories for your little one
vi: Tạo những câu chuyện cá nhân hóa cho bé yêu

# profile_gender_title
source: Gender
vi: Giới Tính

# profile_baby_age_stage_title
source: Baby's Age Stage
vi: Giai Đoạn Tuổi Của Bé

# profile_due_date_title
source: Due Date
vi: Ngày Dự Sinh

# profile_date_of_birth_title
source: Date of Birth
vi: Ngày Sinh

# profile_interests_title
source: Interests
vi: Sở Thích

# profile_parent_names_title
source: Parent Names
vi: Tên Cha Mẹ

# profile_parent_name_placeholder
source: Parent %d name
vi: Tên cha/mẹ %d

# profile_continue_button
source: Continue
vi: Tiếp Tục

# onboarding_preferences_perfect_almost_done
source: Perfect! Almost Done
vi: Hoàn Hảo! Sắp Xong Rồi

# onboarding_preferences_when_story_time
source: When would you like story time?
vi: Bạn muốn giờ kể chuyện vào lúc nào?

# onboarding_preferences_story_time_description
source: Set your preferred time and we'll send gentle reminders for magical bedtime stories
vi: Đặt thời gian ưa thích của bạn và chúng tôi sẽ gửi lời nhắc nhở nhẹ nhàng cho những câu chuyện ru ngủ kỳ diệu

# onboarding_preferences_story_time
source: Story Time
vi: Giờ Kể Chuyện

# onboarding_preferences_bedtime_stories_at
source: Bedtime Stories at
vi: Câu Chuyện Ru Ngủ Lúc

# onboarding_preferences_perfect_time_for
source: Perfect Time For
vi: Thời Gian Hoàn Hảo Cho

# onboarding_preferences_profile_summary
source: Profile Summary
vi: Tóm Tắt Hồ Sơ

# onboarding_preferences_not_set
source: Not set
vi: Chưa thiết lập

# onboarding_preferences_name
source: Name
vi: Tên

# onboarding_preferences_stage
source: Stage
vi: Giai Đoạn

# onboarding_preferences_gender
source: Gender
vi: Giới Tính

# onboarding_preferences_language
source: Language
vi: Ngôn Ngữ

# onboarding_preferences_age
source: Age
vi: Tuổi

# onboarding_preferences_interests
source: Interests
vi: Sở Thích

# onboarding_preferences_selected
source: selected
vi: đã chọn

# onboarding_preferences_start_creating_stories
source: Start Creating Stories!
vi: Bắt Đầu Tạo Câu Chuyện!

# onboarding_preferences_cancel
source: Cancel
vi: Hủy

# onboarding_preferences_done
source: Done
vi: Xong

# settings_cancel
source: Cancel
vi: Hủy

# settings_enable
source: Enable
vi: Bật

# settings_manage
source: Manage
vi: Quản Lý

# settings_save_changes
source: Save Changes
vi: Lưu Thay Đổi

# settings_saving
source: Saving...
vi: Đang lưu...

# settings_error
source: Error
vi: Lỗi

# settings_title
source: Settings
vi: Cài Đặt

# settings_subtitle
source: Customize your experience
vi: Tùy chỉnh trải nghiệm của bạn

# edit_profile_title
source: Edit Profile
vi: Chỉnh Sửa Hồ Sơ

# edit_profile_subtitle
source: Update baby information
vi: Cập nhật thông tin bé

# edit_profile_loading
source: Saving profile...
vi: Đang lưu hồ sơ...

# edit_profile_baby_name_label
source: Baby's Name
vi: Tên của Bé

# edit_profile_baby_name_placeholder
source: What will you call your baby?
vi: Bạn sẽ gọi bé bằng tên gì?

# edit_profile_child_name_label
source: Name
vi: Tên

# edit_profile_child_name_placeholder
source: Enter your child's name
vi: Nhập tên của con bạn

# edit_profile_unsaved_changes_title
source: Unsaved Changes
vi: Thay Đổi Chưa Lưu

# edit_profile_unsaved_changes_message
source: You have unsaved changes. What would you like to do?
vi: Bạn có những thay đổi chưa lưu. Bạn muốn làm gì?

# edit_profile_discard_changes
source: Discard Changes
vi: Bỏ Thay Đổi

# edit_profile_keep_editing
source: Keep Editing
vi: Tiếp Tục Chỉnh Sửa

# edit_profile_unknown_error
source: An unknown error occurred
vi: Đã xảy ra lỗi không xác định

# settings_profile_title
source: Profile
vi: Hồ Sơ

# settings_profile_edit
source: Edit Profile
vi: Chỉnh Sửa Hồ Sơ

# settings_baby_stage_title
source: Baby Stage
vi: Giai Đoạn Bé

# settings_gender_title
source: Gender
vi: Giới Tính

# settings_interests_title
source: Interests
vi: Sở Thích

# settings_preferences_title
source: Preferences
vi: Tùy Chọn

# settings_app_theme_title
source: App Theme
vi: Giao Diện Ứng Dụng

# settings_theme_system_description
source: Follows your device setting
vi: Theo cài đặt thiết bị của bạn

# settings_theme_light_description
source: Always use light appearance
vi: Luôn sử dụng giao diện sáng

# settings_theme_dark_description
source: Always use dark appearance
vi: Luôn sử dụng giao diện tối

# settings_auto_update_profile_title
source: Auto-Update Profile
vi: Tự Động Cập Nhật Hồ Sơ

# settings_auto_update_profile_description
source: Manage automatic profile updates as your child grows
vi: Quản lý cập nhật hồ sơ tự động khi con bạn lớn lên

# settings_voice_narration_title
source: Voice Narration
vi: Kể Chuyện Bằng Giọng Nói

# settings_voice_narration_description
source: Enable story read-aloud
vi: Bật chế độ đọc câu chuyện

# settings_notifications_title
source: Notifications
vi: Thông Báo

# settings_notifications_enabled_title
source: Notifications Enabled
vi: Thông Báo Đã Bật

# settings_notifications_enabled_description
source: You'll receive story reminders and updates
vi: Bạn sẽ nhận được lời nhắc câu chuyện và cập nhật

# settings_notifications_disabled_title
source: Notifications Disabled
vi: Thông Báo Đã Tắt

# settings_notifications_disabled_description
source: Enable in Settings to get reminders
vi: Bật trong Cài đặt để nhận lời nhắc

# settings_support_title
source: Support
vi: Hỗ Trợ

# settings_support_get_help
source: Get Help
vi: Nhận Trợ Giúp

# settings_support_description
source: Visit our support website
vi: Truy cập website hỗ trợ của chúng tôi

# settings_about_title
source: About
vi: Giới Thiệu

# settings_about_version
source: Version
vi: Phiên Bản

# auto_update_settings_title
source: Auto-Update Settings
vi: Cài Đặt Tự Động Cập Nhật

# auto_update_profile_title
source: Auto-Update Profile
vi: Tự Động Cập Nhật Hồ Sơ

# auto_update_profile_description
source: Automatically update baby stage and interests as your child grows
vi: Tự động cập nhật giai đoạn bé và sở thích khi con bạn lớn lên

# auto_update_stage_progression_title
source: Baby Stage Progression
vi: Tiến Triển Giai Đoạn Bé

# auto_update_stage_progression_description
source: Update stage based on age (newborn → infant → toddler → preschooler)
vi: Cập nhật giai đoạn dựa trên tuổi (sơ sinh → trẻ sơ sinh → trẻ mới biết đi → trẻ mầm non)

# auto_update_interests_title
source: Age-Appropriate Interests
vi: Sở Thích Phù Hợp Với Tuổi

# auto_update_interests_description
source: Update interests to match your child's developmental stage
vi: Cập nhật sở thích phù hợp với giai đoạn phát triển của con bạn

# auto_update_enabled_footer
source: Auto-updates help keep your child's profile current as they grow, ensuring stories and activities remain age-appropriate.
vi: Tự động cập nhật giúp giữ cho hồ sơ của con bạn luôn hiện tại khi chúng lớn lên, đảm bảo các câu chuyện và hoạt động phù hợp với lứa tuổi.

# auto_update_disabled_footer
source: Enable auto-updates to automatically maintain your child's profile as they grow.
vi: Bật tự động cập nhật để tự động duy trì hồ sơ của con bạn khi chúng lớn lên.

# auto_update_check_now
source: Check for Updates Now
vi: Kiểm Tra Cập Nhật Ngay

# auto_update_last_update
source: Last Auto-Update
vi: Lần Tự Động Cập Nhật Cuối

# auto_update_status_title
source: Update Status
vi: Trạng Thái Cập Nhật

# auto_update_check_complete_title
source: Update Check Complete
vi: Kiểm Tra Cập Nhật Hoàn Tất

# auto_update_success_message
source: Profile updated successfully! %d change(s) were made.
vi: Hồ sơ đã được cập nhật thành công! %d thay đổi đã được thực hiện.

# auto_update_no_updates_message
source: Your profile is already up to date.
vi: Hồ sơ của bạn đã được cập nhật mới nhất.

# auto_update_failed_message
source: Update check failed. Please try again later.
vi: Kiểm tra cập nhật thất bại. Vui lòng thử lại sau.

# auto_update_last_updated_format
source: Profile last updated: %@
vi: Hồ sơ được cập nhật lần cuối: %@

# settings_story_time_title
source: Story Time
vi: Giờ Kể Chuyện

# settings_preferred_story_time
source: Preferred Story Time
vi: Giờ Kể Chuyện Ưa Thích

source: Done
vi: Xong

# settings_language_title
source: Language
vi: Ngôn Ngữ

# settings_date_of_birth_title
source: Date of Birth
vi: Ngày Sinh

# settings_parent_names_title
source: Parent Names
vi: Tên Cha Mẹ

# settings_parent_name_placeholder
source: Parent %d name
vi: Tên cha/mẹ %d

# edit_profile_language_label
source: Preferred Language
vi: Ngôn Ngữ Ưa Thích

# preview_parent_name
source: Parent 1
vi: Cha Mẹ

# home_little_one
source: Little One
vi: Bé Yêu

# home_ready_for_adventure
source: Ready for a magical story adventure?
vi: Sẵn sàng cho một cuộc phiêu lưu kỳ diệu?

# home_back_button
source: Back
vi: Quay Lại

# home_home_button
source: Home
vi: Trang Chủ

# home_no_story_generated
source: No story generated.
vi: Chưa có câu chuyện nào được tạo.

# home_hello_greeting
source: Hello, %@! 👋
vi: Xin chào, %@! 👋

# home_todays_adventure
source: Today's Adventure
vi: Cuộc Phiêu Lưu Hôm Nay

# home_create_todays_story
source: Create Today's Story
vi: Tạo Câu Chuyện Hôm Nay

# home_creating_magical_story
source: Creating your magical story...
vi: Đang tạo câu chuyện kỳ diệu của bạn...

# home_story_options
source: Story Options
vi: Tùy Chọn Câu Chuyện

# home_custom_story
source: Custom Story
vi: Câu Chuyện Tùy Chỉnh

# home_custom_story_subtitle
source: Choose themes, characters & more
vi: Chọn chủ đề, nhân vật & nhiều hơn nữa

# home_story_library
source: Story Library
vi: Thư Viện Câu Chuyện

# home_story_library_subtitle
source: Browse saved stories
vi: Duyệt xem các câu chuyện đã lưu

# home_progress
source: Progress
vi: Tiến Độ

# home_progress_subtitle
source: Track reading journey
vi: Theo dõi hành trình đọc sách

# home_coming_soon
source: Coming Soon
vi: Sắp Ra Mắt

# home_favorites
source: Favorites
vi: Yêu Thích

# home_favorites_subtitle
source: Most loved stories
vi: Những câu chuyện được yêu thích nhất

# library_stories_count
source: %d magical stories
vi: %d câu chuyện kỳ diệu

# library_empty_title
source: No Stories Yet
vi: Chưa Có Câu Chuyện Nào

# library_empty_description
source: Create your first magical story to see it here!
vi: Tạo câu chuyện kỳ diệu đầu tiên để xem tại đây!

# home_story_time
source: Story Time
vi: Giờ Kể Chuyện

# home_next_story_time
source: Next story time
vi: Giờ kể chuyện tiếp theo

# home_stories_read
source: Stories read
vi: Số câu chuyện đã đọc

# gender_display_name_male
source: Boy
vi: Bé Trai

# gender_display_name_female
source: Girl
vi: Bé Gái

# gender_display_name_not_specified
source: Not Specified
vi: Không Xác Định

# gender_pronoun_male
source: he
vi: nó

# gender_pronoun_female
source: she
vi: nó

# gender_pronoun_not_specified
source: they
vi: nó

# gender_possessive_pronoun_male
source: his
vi: của nó

# gender_possessive_pronoun_female
source: her
vi: của nó

# gender_possessive_pronoun_not_specified
source: their
vi: của nó

# user_profile_age_month_singular
source: month
vi: tháng

# user_profile_age_month_plural
source: months
vi: tháng

# user_profile_age_year_singular
source: year
vi: tuổi

# user_profile_age_year_plural
source: years
vi: tuổi

# user_profile_baby_prefix
source: Baby
vi: Bé

# user_profile_default_parent_names
source: Mommy and Daddy
vi: Bố và Mẹ

# user_profile_story_context_baby_prefix
source: A story for baby
vi: Câu chuyện cho bé

# user_profile_story_context_from
source: from
vi: từ

# user_profile_story_context_gentle_story
source: A gentle story for little
vi: Câu chuyện nhẹ nhàng cho bé

# user_profile_story_context_adventure_story
source: An adventure story for
vi: Câu chuyện phiêu lưu cho

# user_profile_greeting_morning
source: Good morning!
vi: Chào buổi sáng!

# user_profile_greeting_afternoon
source: Good afternoon!
vi: Chào buổi chiều!

# user_profile_greeting_evening
source: Good evening!
vi: Chào buổi tối!

# user_profile_greeting_night
source: Sweet dreams!
vi: Chúc ngủ ngon!

# user_profile_welcome_pregnancy
source: Ready for a bonding story?
vi: Sẵn sàng cho câu chuyện gắn kết?

# user_profile_welcome_newborn_infant
source: Time for a gentle story?
vi: Đã đến giờ nghe câu chuyện nhẹ nhàng?

# user_profile_welcome_toddler
source: Ready for an adventure?
vi: Sẵn sàng cho cuộc phiêu lưu?

# user_profile_welcome_preschooler
source: What story shall we explore?
vi: Chúng ta sẽ khám phá câu chuyện nào?

# user_profile_growth_newborn
source: 🎉 Welcome to the world, %@! %@ is now a newborn!
vi: 🎉 Chào mừng bé %@ đến với thế giới! %@ giờ đã là một em bé sơ sinh!

# user_profile_growth_infant
source: 🌟 %@ is growing! %@ is now an infant and ready for new adventures!
vi: 🌟 %@ đang lớn lên! %@ giờ đã là một trẻ sơ sinh và sẵn sàng cho những cuộc phiêu lưu mới!

# user_profile_growth_toddler
source: 🚀 Look who's growing up! %@ is now a toddler and ready for exciting stories!
vi: 🚀 Nhìn ai đang lớn lên đây! %@ giờ đã là một bé mới biết đi và sẵn sàng cho những câu chuyện thú vị!

# user_profile_growth_preschooler
source: 📚 %@ is becoming such a big kid! %@ is now a preschooler!
vi: 📚 %@ đang trở thành một bé lớn! %@ giờ đã là một bé mầm non!

# profile_validation_due_date_far_future
source: Due date is quite far in the future. Please double-check the date.
vi: Ngày sinh dự kiến khá xa trong tương lai. Vui lòng kiểm tra lại ngày tháng.

# profile_validation_parent_names_too_long
source: Consider using shorter parent names for better story flow.
vi: Nên sử dụng tên bố mẹ ngắn hơn để câu chuyện được diễn ra tự nhiên hơn.

# profile_validation_child_age_too_old
source: This app is designed for children under %d years old.
vi: Ứng dụng này được thiết kế cho trẻ em dưới %d tuổi.

# profile_validation_stage_mismatch
source: Your child may have grown to the %@ stage.
vi: Con bạn có thể đã lớn lên đến giai đoạn %@.

# profile_validation_too_many_interests
source: Consider selecting fewer interests for more focused stories.
vi: Nên chọn ít sở thích hơn để có những câu chuyện tập trung hơn.

# profile_validation_inappropriate_interests
source: Some interests may not be suitable for the %@ stage.
vi: Một số sở thích có thể không phù hợp với giai đoạn %@.

# app_error_story_generation_failed
source: Unable to generate story. Please try again.
vi: Không thể tạo câu chuyện. Vui lòng thử lại.

# app_error_profile_save_failed
source: Failed to save profile changes.
vi: Không thể lưu thay đổi hồ sơ.

# app_error_story_save_failed
source: Failed to save story to library.
vi: Không thể lưu câu chuyện vào thư viện.

# app_error_invalid_profile
source: Profile information is incomplete or invalid.
vi: Thông tin hồ sơ không đầy đủ hoặc không hợp lệ.

# app_error_network_unavailable
source: Network connection unavailable.
vi: Kết nối mạng không khả dụng.

# app_error_data_corruption
source: Data appears to be corrupted. Please restart the app.
vi: Dữ liệu có vẻ bị hỏng. Vui lòng khởi động lại ứng dụng.

# app_error_data_save_failed
source: Failed to save data. Please try again.
vi: Không thể lưu dữ liệu. Vui lòng thử lại.

# app_error_data_export_failed
source: Failed to export data. Please try again.
vi: Không thể xuất dữ liệu. Vui lòng thử lại.

# app_error_data_import_failed
source: Failed to import data. Please check the file and try again.
vi: Không thể nhập dữ liệu. Vui lòng kiểm tra tệp và thử lại.

# app_error_invalid_data
source: Invalid data format. Please try again.
vi: Định dạng dữ liệu không hợp lệ. Vui lòng thử lại.

# app_error_daily_story_limit_reached
source: You've reached your daily story limit.
vi: Bạn đã đạt đến giới hạn câu chuyện hàng ngày.

# app_error_invalid_configuration
source: Invalid story generation configuration.
vi: Cấu hình tạo câu chuyện không hợp lệ.

# app_error_invalid_name
source: Please enter a valid name.
vi: Vui lòng nhập tên hợp lệ.

# app_error_invalid_date
source: Please select a valid date.
vi: Vui lòng chọn ngày hợp lệ.

# app_error_invalid_story_options
source: Story options are invalid. Please check your selections.
vi: Tùy chọn câu chuyện không hợp lệ. Vui lòng kiểm tra lại.

# app_error_invalid_character_count
source: Too many characters selected. Please choose up to 5 characters.
vi: Quá nhiều nhân vật được chọn. Vui lòng chọn tối đa 5 nhân vật.

# app_error_profile_incomplete
source: Please complete all required profile fields.
vi: Vui lòng hoàn thành tất cả các trường hồ sơ bắt buộc.

# app_error_recovery_story_generation
source: Check your internet connection and try generating the story again.
vi: Kiểm tra kết nối internet và thử tạo câu chuyện lại.

# app_error_recovery_save_retry
source: Please try saving again. If the problem persists, restart the app.
vi: Vui lòng thử lưu lại. Nếu vấn đề vẫn tiếp tục, hãy khởi động lại ứng dụng.

# app_error_recovery_profile_complete
source: Please complete all required profile fields.
vi: Vui lòng hoàn thành tất cả các trường hồ sơ bắt buộc.

# app_error_recovery_network
source: Please check your internet connection and try again.
vi: Vui lòng kiểm tra kết nối internet và thử lại.

# app_error_recovery_data_corruption
source: Please restart the app. If the problem persists, contact support.
vi: Vui lòng khởi động lại ứng dụng. Nếu vấn đề vẫn tiếp tục, hãy liên hệ hỗ trợ.

# app_error_recovery_storage_space
source: Please ensure you have enough storage space and try again.
vi: Vui lòng đảm bảo bạn có đủ dung lượng lưu trữ và thử lại.

# app_error_recovery_file_corruption
source: The file appears to be corrupted. Please try a different file.
vi: Tệp có vẻ bị hỏng. Vui lòng thử một tệp khác.

# app_error_recovery_data_validation
source: Please check your input and try again.
vi: Vui lòng kiểm tra thông tin nhập vào và thử lại.

# app_error_recovery_upgrade_subscription
source: Upgrade your subscription to generate more stories.
vi: Nâng cấp gói đăng ký để tạo thêm câu chuyện.
